// フロント側に投げるデータ型
export type ReturnItems = {
  /**  ボード */
  board: number[][];

  /**  現在オセロを返せるユーザ */
  nowTurn: number;

  /** 送ってきたユーザはそもそもオセロを返せるか */
  youCanTurn: boolean;

  /** オセロの数 */
  win: { black: number; white: number };

  /** フロントに流すメッセージ */
  msg: string;
};

// オセロ盤面テンプレート用
export const newBoardTemplate = [
  [0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 2, 1, 0, 0, 0],
  [0, 0, 0, 1, 2, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0],
];

// オセロの方向
export const directions: number[][] = [
  [1, 0],
  [-1, 0],
  [0, 1],
  [0, -1],
  [1, 1],
  [-1, -1],
  [1, -1],
  [-1, 1],
];
